# RemovingReferencesFromGroupedCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..RemovingReferencesFromGroupedCurve Property
BuiltInFailures..::..GroupFailures Class See Also
---
References to elements outside the group were removed from a grouped curve element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RemovingReferencesFromGroupedCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RemovingReferencesFromGroupedCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RemovingReferencesFromGroupedCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace